app/Services/CropStageCache.php

select * from `crop_stages`
---
    public static function all(): Collection
    {
        if (self::$stages === null) {
            self::$stages = CropStage::all();