app/Services/CropStageTimelineService.php

    public function generateTimeline(Crop $crop): array
    {
        $timeline = [];

        // Ensure relationships are loaded
        if (!$crop->relationLoaded('recipe')) {
            $crop->load('recipe');
        }
        if (!$crop->relationLoaded('currentStage')) {
            $crop->load('currentStage');
---
select * from `recipes` where `recipes`.`id` in (2)
select * from `crop_stages` where `crop_stages`.`id` in (1)