app/Services/CropTaskManagementService.php

            ]);

            // Fallback: Direct lookup of the stage
            $stageFromDirect = CropStage::find($crop->current_stage_id);
---
select * from `crop_stages` where `crop_stages`.`id` = 4 limit 1