app/Services/CropValidationService.php

select * from `recipes` where `recipes`.`id` = '3' limit 1
---
    public function initializeNewCrop(Crop $crop): void
    {
        // Auto-set requires_soaking based on recipe
        if ($crop->recipe_id && !isset($crop->requires_soaking)) {
            $recipe = \App\Models\Recipe::find($crop->recipe_id);