app/Services/CropStageTransitionService.php

    private function getCropsForTransition($target): Collection
    {
        if ($target instanceof Crop) {
            // If using batch_id, get all crops in batch
            if ($target->crop_batch_id) {
                return Crop::where('crop_batch_id', $target->crop_batch_id)
                    ->with(['recipe', 'currentStage'])
                    ->get();
---
select * from `crop_stages` where `crop_stages`.`id` in (2)
select * from `crops` where `crop_batch_id` = '1'
select * from `recipes` where `recipes`.`id` in (3)

    private function lockCropsForUpdate(Collection $crops): void
    {
        $ids = $crops->pluck('id')->toArray();

        // Use pessimistic locking
        Crop::whereIn('id', $ids)->lockForUpdate()->get();
---
select * from `crops` where `id` in (1, 2, 3) for update

    private function getNextStage(CropStage $currentStage): ?CropStage
    {
        return CropStage::where('sort_order', '>', $currentStage->sort_order)
            ->where('is_active', true)
            ->orderBy('sort_order')
            ->first();
---
select * from `crop_stages` where `sort_order` > 1 and `is_active` = 1 order by `sort_order` asc limit 1

    private function getPreviousStage(CropStage $currentStage): ?CropStage
    {
        return CropStage::where('sort_order', '<', $currentStage->sort_order)
            ->where('is_active', true)
            ->orderBy('sort_order', 'desc')
            ->first();
---
select * from `crop_stages` where `sort_order` > 2 and `is_active` = 1 order by `sort_order` asc limit 1

    private function performAdvancement(Collection $crops, CropStage $currentStage, CropStage $nextStage, Carbon $transitionTime, array $options): array
    {
        $results = [
            'advanced' => 0,
            'failed' => 0,
            'warnings' => [],
            'crops' => [],
            'affected_count' => 0,
        ];

        $timestampField = self::STAGE_TIMESTAMP_MAP[$nextStage->code] ?? null;
        $recordStageHistory = app(RecordStageHistory::class);

        foreach ($crops as $crop) {
            try {
                // Update tray number if advancing from soaking
                if ($currentStage->code === 'soaking' && isset($options['tray_numbers'][$crop->id])) {
                    $crop->tray_number = $options['tray_numbers'][$crop->id];
                }

                // Update stage
                $crop->current_stage_id = $nextStage->id;

                // Update timestamp
                if ($timestampField) {
                    $crop->$timestampField = $transitionTime;
                }

                // Save and refresh
                $crop->save();
---
update `crops` set `current_stage_id` = 3, `blackout_at` = '2025-07-21 09:14:00', `time_to_next_stage_minutes` = 5758, `time_to_next_stage_display` = '3d 23h', `stage_age_minutes` = 1, `stage_age_display` = '1m', `total_age_minutes` = 1, `total_age_display` = '1m', `tray_numbers` = '1', `crops`.`updated_at` = '2025-07-21 09:14:08' where `id` = 1

    private function performReversal(Collection $crops, CropStage $currentStage, CropStage $previousStage, ?string $reason): array
    {
        $results = [
            'reverted' => 0,
            'failed' => 0,
            'warnings' => [],
            'crops' => [],
            'affected_count' => 0,
        ];

        $currentTimestampField = self::STAGE_TIMESTAMP_MAP[$currentStage->code] ?? null;
        $recordStageHistory = app(RecordStageHistory::class);

        foreach ($crops as $crop) {
            try {
                // Clear current stage timestamp
                if ($currentTimestampField) {
                    $crop->$currentTimestampField = null;
                }

                // Also clear any future stage timestamps to maintain sequence integrity
                $this->clearFutureTimestamps($crop, $previousStage);

                // Update stage
                $crop->current_stage_id = $previousStage->id;

                // Save and refresh
                $crop->save();
---
update `crops` set `current_stage_id` = 2, `blackout_at` = null, `time_to_next_stage_minutes` = null, `time_to_next_stage_display` = null, `stage_age_minutes` = 7, `stage_age_display` = '7m', `total_age_minutes` = 7, `total_age_display` = '7m', `crops`.`updated_at` = '2025-07-21 09:20:19' where `id` = 1

    private function deactivateTaskSchedulesForStage(Crop $crop, CropStage $stage): void
    {
        TaskSchedule::where('resource_type', 'crops')
            ->where('conditions->crop_id', $crop->id)
            ->where('conditions->stage', $stage->code)
            ->where('is_active', true)
            ->update([
                'is_active' => false,
                'last_run_at' => now(),
            ]);
---
update `task_schedules` set `is_active` = 0, `last_run_at` = '2025-07-21 09:20:27', `task_schedules`.`updated_at` = '2025-07-21 09:20:27' where `resource_type` = 'crops' and json_unquote(json_extract(`conditions`, '$."crop_id"')) = 1 and json_unquote(json_extract(`conditions`, '$."stage"')) = 'germination' and `is_active` = 1