app/Services/InventoryManagementService.php

select count(*) as aggregate from `consumables` where (total_quantity - consumed_quantity) <= restock_threshold
---
    public function getLowStockCount(): int
    {
        return Consumable::whereRaw('(total_quantity - consumed_quantity) <= restock_threshold')->count();

select * from `consumables` where (total_quantity - consumed_quantity) <= restock_threshold order by ((total_quantity - consumed_quantity) / NULLIF(restock_threshold, 0)) ASC limit 10
---
    public function getLowStockItems($limit = null)
    {
        $query = Consumable::whereRaw('(total_quantity - consumed_quantity) <= restock_threshold')
            ->orderByRaw('((total_quantity - consumed_quantity) / NULLIF(restock_threshold, 0)) ASC');

        if ($limit) {
            $query->limit($limit);
        }

        return $query->get();

select `id` from `consumable_types` where `code` = 'seed' limit 1
---
    public function getSeedTypeId(): ?int
    {
        return ConsumableType::where('code', 'seed')->value('id');

select * from `consumables` where `consumable_type_id` = 3 and `lot_no` = '38124' and `is_active` = 1 order by `created_at` asc
---
    public function getEntriesInLot(string $lotNumber): Collection
    {
        $seedTypeId = $this->getSeedTypeId();
        if (!$seedTypeId) {
            return collect();
        }

        return Consumable::where('consumable_type_id', $seedTypeId)
            ->where('lot_no', strtoupper($lotNumber))
            ->where('is_active', true)
            ->orderBy('created_at', 'asc')
            ->get();

select distinct `lot_no` from `consumables` where `consumable_type_id` = 3 and `is_active` = 1 and `lot_no` is not null
---
    public function getAllLotNumbers(): Collection
    {
        $seedTypeId = $this->getSeedTypeId();
        if (!$seedTypeId) {
            return collect();
        }

        return Consumable::where('consumable_type_id', $seedTypeId)
            ->where('is_active', true)
            ->whereNotNull('lot_no')
            ->distinct('lot_no')
            ->pluck('lot_no')
            ->filter()
            ->sort()
            ->values();