app/Services/RecipeVarietyService.php

select * from `master_cultivars` where `master_cultivars`.`id` in (20)
select * from `master_seed_catalog` where `master_seed_catalog`.`id` in (17)
---
    public function getFullVarietyName(?Recipe $recipe): string
    {
        if (!$recipe) {
            return 'Unknown';
        }

<<<<<<< Updated upstream
        // Load relationships if not already loaded
        if (!$recipe->relationLoaded('masterCultivar')) {
            $recipe->load('masterCultivar');
        }
        if (!$recipe->relationLoaded('masterSeedCatalog')) {
            $recipe->load('masterSeedCatalog');