app/Collections/CropBatchCollection.php

    public function withComputedAttributes(): self
    {
        // Preload all stages to avoid individual queries
        $stages = \App\Models\CropStage::all()->keyBy('id');
---
select * from `crop_stages`