app/Filament/Resources/CropAlertResource/Tables/CropAlertTable.php

    protected static function getTrayNumberColumn(): TextColumn
    {
        return TextColumn::make('tray_number')
            ->label('Batch Trays')
            ->getStateUsing(function (CropAlert $record) {
                // If we have tray_numbers array, it's already a batch operation
                if (isset($record->conditions['tray_numbers']) && is_array($record->conditions['tray_numbers'])) {
                    $count = count($record->conditions['tray_numbers']);
                    return "{$count} trays";
                }

                // For operations targeting single trays, find the batch info
                if (isset($record->conditions['crop_id'])) {
                    $cropId = $record->conditions['crop_id'];
                    $crop = Crop::find($cropId);
---
select * from `crops` where `crops`.`id` = 1 limit 1

    protected static function getSeedVarietyColumn(): TextColumn
    {
        return TextColumn::make('seed_variety')
            ->label('Seed Variety')
            ->getStateUsing(function (CropAlert $record) {
                $cropId = $record->conditions['crop_id'] ?? null;
                if (!$cropId) return 'Unknown';

                $crop = Crop::with(['recipe.masterSeedCatalog', 'recipe.masterCultivar'])->find($cropId);
---
select * from `crops` where `crops`.`id` = 4 limit 1