app/Filament/Resources/CropResource/Actions/StageTransitionActions.php

    public static function advanceStage(): Action
    {
        return Action::make('advanceStage')
            ->label(function ($record): string {
                $currentStage = CropStage::find($record->current_stage_id);
                $nextStage = $currentStage ? CropStage::where('sort_order', '>', $currentStage->sort_order)
                    ->where('is_active', true)
                    ->orderBy('sort_order')
                    ->first() : null;
                return $nextStage ? 'Advance to ' . ucfirst($nextStage->name) : 'Harvested';
            })
            ->icon('heroicon-o-chevron-double-right')
            ->color('success')
            ->visible(function ($record): bool {
                $stage = CropStage::find($record->current_stage_id);
---
select * from `crop_stages` where `crop_stages`.`id` = 5 limit 1
select * from `crop_stages` where `sort_order` > 0 and `is_active` = 1 order by `sort_order` asc limit 1

    public static function rollbackStage(): Action
    {
        return Action::make('rollbackStage')
            ->label(function ($record): string {
                $currentStage = CropStage::find($record->current_stage_id);
                $previousStage = $currentStage ? CropStage::where('sort_order', '<', $currentStage->sort_order)
                    ->where('is_active', true)
                    ->orderBy('sort_order', 'desc')
                    ->first() : null;
                return $previousStage ? 'Rollback to ' . ucfirst($previousStage->name) : 'Cannot Rollback';
            })
            ->icon('heroicon-o-arrow-uturn-left')
            ->color('warning')
            ->visible(function ($record): bool {
                $stage = CropStage::find($record->current_stage_id);
---
select * from `crop_stages` where `crop_stages`.`id` = 2 limit 1
select * from `crop_stages` where `sort_order` < 2 and `is_active` = 1 order by `sort_order` desc limit 1
select * from `crop_stages` where `crop_stages`.`id` = 5 limit 1

    public static function harvest(): Action
    {
        return Action::make('harvest')
            ->label('Harvest')
            ->icon('heroicon-o-scissors')
            ->color('success')
            ->visible(function ($record): bool {
                $stage = CropStage::find($record->current_stage_id);
---
select * from `crop_stages` where `crop_stages`.`id` = 5 limit 1