app/Filament/Resources/CropResource/Pages/CreateCrop.php

select * from `recipes` where `recipes`.`id` = '3' limit 1
---
    protected function handleRecordCreation(array $data): Model
    {
        // Extract tray numbers
        $trayNumbers = [];

        if (isset($data['tray_numbers'])) {
            // Convert to array regardless of input format
            if (is_array($data['tray_numbers'])) {
                $trayNumbers = $data['tray_numbers'];
            } elseif (is_string($data['tray_numbers'])) {
                // Try to decode JSON string
                $decoded = json_decode($data['tray_numbers'], true);
                if (is_array($decoded)) {
                    $trayNumbers = $decoded;
                } else {
                    // Fallback - split by comma
                    $trayNumbers = explode(',', $data['tray_numbers']);
                }
            }
        }

        // Filter out empty values and flatten if needed
        $trayNumbers = array_filter($trayNumbers, function($value) {
            return !empty(trim($value)) && !is_array($value);
        });

        // Check if recipe requires soaking - if so, tray numbers are optional
        $recipe = null;
        if (isset($data['recipe_id'])) {
            $recipe = Recipe::find($data['recipe_id']);

select * from `recipes` where `recipes`.`id` = '3' limit 1
select * from `recipes_optimized_view` where `recipes_optimized_view`.`id` = '3' limit 1
---
        $varietyName = 'Unknown Variety';

        if (isset($data['recipe_id'])) {
            $recipe = Recipe::find($data['recipe_id']);
            $recipeOptimized = \App\Models\RecipeOptimizedView::find($data['recipe_id']);

select * from `crop_batches` where exists (select * from `crops` where `crop_batches`.`id` = `crops`.`crop_batch_id` and `recipe_id` = '3' and `planting_at` = '2025-07-21 00:37:00' and `current_stage_id` = 1) limit 1
---

            // Check if there's an existing batch for this recipe + planting date + stage combination
            $currentStageId = $data['current_stage_id'] ?? 1; // Default to stage 1 if not set
            $existingBatch = CropBatch::whereHas('crops', function($query) use ($data, $plantedAt, $currentStageId) {
                $query->where('recipe_id', $data['recipe_id'])
                      ->where('planting_at', $plantedAt->format('Y-m-d H:i:s'))
                      ->where('current_stage_id', $currentStageId);
            })->first();

insert into `crops` (`recipe_id`, `planting_at`, `notes`, `tray_number`, `time_to_next_stage_minutes`, `stage_age_minutes`, `total_age_minutes`, `requires_soaking`, `germination_at`, `current_stage_id`, `time_to_next_stage_display`, `stage_age_display`, `total_age_display`, `updated_at`, `created_at`) values ('19', '2025-07-20 22:50:00', null, '1', 0, 0, 0, 0, '2025-07-20 22:50:00', 1, 'Unknown', '0m', '0m', '2025-07-20 23:02:20', '2025-07-20 23:02:20')
insert into `crop_batches` (`recipe_id`, `updated_at`, `created_at`) values ('3', '2025-07-21 00:38:03', '2025-07-21 00:38:03')
---
                ]);
            } else {
                // Create a new batch record
                $batch = CropBatch::create([
                    'recipe_id' => $data['recipe_id'],
                ]);

insert into `crops` (`recipe_id`, `planting_at`, `notes`, `tray_number`, `time_to_next_stage_minutes`, `stage_age_minutes`, `total_age_minutes`, `crop_batch_id`, `requires_soaking`, `current_stage_id`, `time_to_next_stage_display`, `stage_age_display`, `total_age_display`, `updated_at`, `created_at`) values ('3', '2025-07-21 00:37:00', null, '1', 0, 0, 0, 1, 0, 2, 'Unknown', '0m', '0m', '2025-07-21 00:38:03', '2025-07-21 00:38:03')
---
                if ($cropBatchId) {
                    $cropData['crop_batch_id'] = $cropBatchId;
                }
                $crop = Crop::create($cropData);