app/Filament/Resources/CropResource/Pages/ListCrops.php

select * from `master_cultivars` where `master_cultivars`.`id` in (3, 20)
select * from `master_seed_catalog` where `master_seed_catalog`.`id` in (3, 17)
select * from `recipes`
---
    protected function getTableQuery(): \Illuminate\Database\Eloquent\Builder
    {
        $query = parent::getTableQuery();

        // Add additional logging for debugging
        Log::info('Recipe and Seed Entry Data:', [
            'recipes' => \App\Models\Recipe::with('masterSeedCatalog', 'masterCultivar')->get()->map(function($recipe) {
                return [
                    'id' => $recipe->id,
                    'name' => $recipe->name,
                    'common_name' => $recipe->common_name,
                    'cultivar_name' => $recipe->cultivar_name,
                ];
            })
        ]);

select count(*) as aggregate from `crops` where `current_stage_id` = 5 and `requires_soaking` = 1 and `soaking_at` is not null
---
    protected function getActiveSoakingCount(): int
    {
        $soakingStage = \App\Models\CropStage::findByCode('soaking');

        if (!$soakingStage) {
            return 0;
        }

        return Crop::where('current_stage_id', $soakingStage->id)
            ->where('requires_soaking', true)
            ->whereNotNull('soaking_at')
            ->count();

select * from `crops` where `current_stage_id` = 5 and `requires_soaking` = 1 and `soaking_at` is not null
select * from `recipes` where `recipes`.`id` in (1, 2)
---
    protected function hasOverdueSoaking(): bool
    {
        $soakingStage = \App\Models\CropStage::findByCode('soaking');

        if (!$soakingStage) {
            return false;
        }

        $soakingCrops = Crop::with('recipe')
            ->where('current_stage_id', $soakingStage->id)
            ->where('requires_soaking', true)
            ->whereNotNull('soaking_at')
            ->get();