app/Filament/Resources/Consumables/Components/ConsumableFormComponents.php

    public static function getCostInformationSection(bool $alwaysVisible = false): Section
    {
        return Section::make('Cost Information')
            ->schema([
                Grid::make(3)
                    ->schema([
                        TextInput::make('cost_per_unit')
                            ->label('Cost per Unit')
                            ->prefix('$')
                            ->numeric()
                            ->minValue(0)
                            ->step(0.01)
                            ->helperText(function (Get $get) {
                                $typeId = $get('consumable_type_id');
                                $type = $typeId ? ConsumableType::find($typeId) : null;

                                if ($type && $type->isSeed()) {
                                    return 'Cost per ' . ($get('quantity_unit') ?: 'unit');
                                } else {
                                    $unitId = $get('consumable_unit_id');
                                    $unit = $unitId ? ConsumableUnit::find($unitId) : null;
                                    return 'Cost per ' . ($unit ? $unit->symbol : 'unit');
                                }
                            }),
                        TextInput::make('last_purchase_price')
                            ->label('Last Purchase Price')
                            ->prefix('$')
---
select * from `consumable_types` where `consumable_types`.`id` = 3 limit 1

                            ->disabled()
                            ->dehydrated(false)
                            ->visible(fn ($record) => $record !== null),
                        Placeholder::make('total_value')
                            ->label('Total Inventory Value')
                            ->content(function (Get $get) {
                                $costPerUnit = (float) $get('cost_per_unit');
                                $typeId = $get('consumable_type_id');
                                $type = $typeId ? ConsumableType::find($typeId) : null;

                                if ($type && $type->isSeed()) {
                                    $total = (float) $get('total_quantity');
                                    $consumed = (float) $get('consumed_quantity');
                                    $available = max(0, $total - $consumed);
                                    $value = $available * $costPerUnit;
                                } else {
                                    $initial = (float) $get('initial_stock');
                                    $consumed = (float) $get('consumed_quantity');
                                    $available = max(0, $initial - $consumed);
                                    $value = $available * $costPerUnit;
                                }
                                return '$' . number_format($value, 2);
                            }),
---
select * from `consumable_types` where `consumable_types`.`id` = 3 limit 1

                    return true;
                }
                $typeId = $get('consumable_type_id');
                $type = $typeId ? ConsumableType::find($typeId) : null;
---
select * from `consumable_types` where `consumable_types`.`id` = 3 limit 1