app/Filament/Resources/RecipeResource/Pages/EditRecipe.php

    public function form(Form $form): Form
    {
        return $form->schema([
            Section::make('Basic Information')
                ->description('Edit the basic recipe information')
                ->schema([
                    TextInput::make('name')
                        ->label('Recipe Name')
                        ->required()
                        ->maxLength(255)
                        ->placeholder('Enter a descriptive name for this recipe')
                        ->extraInputAttributes(['onkeydown' => 'if(event.key === "Enter") { event.preventDefault(); }'])
                        ->columnSpanFull(),

                    Select::make('seed_variety_helper')
                        ->label('Seed Variety')
                        ->options(function () {
                            // Get unique seed varieties with lot information
                            $varieties = Consumable::whereHas('consumableType', function($query) {
                                    $query->where('code', 'seed');
                                })
                                ->where('is_active', true)
                                ->whereNotNull('name')
                                ->whereNotNull('lot_no')
                                ->whereRaw('(total_quantity - consumed_quantity) > 0')
                                ->get()
                                ->groupBy('name')
                                ->map(function ($group, $name) {
                                    $totalAvailable = $group->sum(function($item) {
                                        return max(0, $item->total_quantity - $item->consumed_quantity);
                                    });
                                    $lotCount = $group->count();
                                    $lotText = $lotCount > 1 ? " ({$lotCount} lots)" : " (1 lot)";

                                    return [
                                        'name' => $name,
                                        'display' => $name . $lotText . " - " . number_format($totalAvailable, 1) . "g available",
---
select * from `consumables` where exists (select * from `consumable_types` where `consumables`.`consumable_type_id` = `consumable_types`.`id` and `code` = 'seed') and `is_active` = 1 and `name` is not null and `lot_no` is not null and (total_quantity - consumed_quantity) > 0