app/Filament/Support/SlidingNavigationBuilder.php

select count(*) as aggregate from `task_schedules` where `resource_type` = 'crops' and `is_active` = 1 and `next_run_at` < '2025-07-21 21:15:52'
---
    private static function getProductionBadge(): ?array
    {
        try {
            // Get overdue task schedules count (using existing TaskSchedule model)
            $overdueCount = \App\Models\TaskSchedule::where('resource_type', 'crops')
                ->where('is_active', true)
                ->where('next_run_at', '<', now())
                ->count();

select count(*) as aggregate from `task_schedules` where `resource_type` = 'crops' and `is_active` = 1 and date(`next_run_at`) = '2025-07-21'
---
    private static function getAlertsBadge(): ?array
    {
        try {
            // Get today's task schedules
            $todayCount = \App\Models\TaskSchedule::where('resource_type', 'crops')
                ->where('is_active', true)
                ->whereDate('next_run_at', today())
                ->count();