app/Filament/Widgets/AnalyticsStatsOverview.php

        $activeProducts = $current->active_products_count ?? 0;

        // Get chart data for last 7 days
        $chartData = Order::join('order_products', 'orders.id', '=', 'order_products.order_id')
            ->join('invoices', 'orders.id', '=', 'invoices.order_id')
            ->where('orders.created_at', '>=', Carbon::now()->subDays(7))
            ->whereNotNull('invoices.sent_at')
            ->selectRaw('DATE(orders.created_at) as date, SUM(order_products.quantity * order_products.price) as total')
            ->groupBy('date')
            ->orderBy('date')
            ->pluck('total')
            ->map(fn($value) => (float) $value)
            ->toArray();
---
select DATE(orders.created_at) as date, SUM(order_products.quantity * order_products.price) as total from `orders` inner join `order_products` on `orders`.`id` = `order_products`.`order_id` inner join `invoices` on `orders`.`id` = `invoices`.`order_id` where `orders`.`created_at` >= '2025-07-13 18:52:03' and `invoices`.`sent_at` is not null group by `date` order by `date` asc