app/Filament/Widgets/ProductPerformanceChart.php

    private function getProductData(): array
    {
        $topProducts = OrderItem::join('orders', 'order_products.order_id', '=', 'orders.id')
            ->join('products', 'order_products.product_id', '=', 'products.id')
            ->join('invoices', 'orders.id', '=', 'invoices.order_id')
            ->where('orders.created_at', '>=', Carbon::now()->subDays(30))
            ->whereNotNull('invoices.sent_at') // Only count sent invoices
            ->selectRaw('products.name, SUM(order_products.quantity * order_products.price) as total_revenue')
            ->groupBy('products.id', 'products.name')
            ->orderByDesc('total_revenue')
            ->limit(5)
            ->get();
---
select products.name, SUM(order_products.quantity * order_products.price) as total_revenue from `order_products` inner join `orders` on `order_products`.`order_id` = `orders`.`id` inner join `products` on `order_products`.`product_id` = `products`.`id` inner join `invoices` on `orders`.`id` = `invoices`.`order_id` where `orders`.`created_at` >= '2025-06-20 18:52:04' and `invoices`.`sent_at` is not null group by `products`.`id`, `products`.`name` order by `total_revenue` desc limit 5