app/Filament/Widgets/SalesRevenueChart.php

select DATE(orders.created_at) as date, SUM(order_products.quantity * order_products.price) as total_revenue from `orders` inner join `order_products` on `orders`.`id` = `order_products`.`order_id` inner join `invoices` on `orders`.`id` = `invoices`.`order_id` where `orders`.`created_at` >= '2025-06-20 18:52:03' and `invoices`.`sent_at` is not null group by `date` order by `date` asc
---
    private function getSalesData(): array
    {
        $orders = Order::join('order_products', 'orders.id', '=', 'order_products.order_id')
            ->join('invoices', 'orders.id', '=', 'invoices.order_id')
            ->where('orders.created_at', '>=', Carbon::now()->subDays(30))
            ->whereNotNull('invoices.sent_at') // Only count sent invoices
            ->selectRaw('DATE(orders.created_at) as date, SUM(order_products.quantity * order_products.price) as total_revenue')
            ->groupBy('date')
            ->orderBy('date')
            ->get();