app/Filament/Resources/ConsumableResource.php

select * from `consumable_types` where `consumable_types`.`id` = 3 limit 1
---
                        Forms\Components\Grid::make()
                            ->schema(function (Get $get) {
                                $typeId = $get('consumable_type_id');
                                $type = $typeId ? ConsumableType::find($typeId) : null;

select * from `consumable_types` where `consumable_types`.`id` = 3 limit 1
---
                            })->columnSpanFull(),

                        // Seed cultivar field - outside conditional logic to fix Livewire binding
                        Forms\Components\Select::make('master_cultivar_id')
                            ->label('Seed Cultivar')
                            ->options(function () {
                                return \App\Models\MasterCultivar::query()
                                    ->with('masterSeedCatalog')
                                    ->where('is_active', true)
                                    ->get()
                                    ->mapWithKeys(function ($cultivar) {
                                        return [$cultivar->id => $cultivar->full_name];
                                    });
                            })
                            ->searchable()
                            ->visible(function (Get $get): bool {
                                $typeId = $get('consumable_type_id');
                                $type = $typeId ? ConsumableType::find($typeId) : null;
                                return $type && $type->isSeed();
                            })
                            ->required(function (Get $get): bool {
                                $typeId = $get('consumable_type_id');
                                $type = $typeId ? ConsumableType::find($typeId) : null;
                                return $type && $type->isSeed();
                            })
                            ->live()
                            ->afterStateUpdated(function ($state, Set $set) {
                                if ($state) {
                                    $cultivar = \App\Models\MasterCultivar::find($state);
                                    if ($cultivar) {
                                        $set('name', $cultivar->full_name);
                                        $set('cultivar', $cultivar->cultivar_name);
                                        $set('master_seed_catalog_id', $cultivar->master_seed_catalog_id);
                                    }
                                }
                            })
                            ->columnSpanFull(),