app/Filament/Resources/CropResource.php

select * from `recipes` where `recipes`.`id` = 5 limit 1
---
    public static function infolist(Infolist $infolist): Infolist
    {
        return $infolist
            ->schema([
                Infolists\Components\Section::make('Crop Details')
                    ->schema([
                        Infolists\Components\Group::make([
                            Infolists\Components\TextEntry::make('variety')
                                ->label('')
                                ->weight('bold')
                                ->size('xl')
                                ->getStateUsing(function ($record) {
                                    if ($record->recipe) {
                                        $varietyService = app(\App\Services\RecipeVarietyService::class);
                                        return $varietyService->getFullVarietyName($record->recipe);
                                    }
                                    return 'Unknown';
                                }),
                            Infolists\Components\TextEntry::make('recipe.name')
                                ->label('')
                                ->color('gray')
                                ->getStateUsing(fn ($record) => $record->recipe?->name ?? 'Unknown Recipe'),
                        ])->columns(1),

                        Infolists\Components\Group::make([
                            Infolists\Components\TextEntry::make('current_stage')
                                ->label('Status')
                                ->badge()
                                ->getStateUsing(fn ($record) => $record->currentStage?->name ?? 'Unknown')
                                ->color(fn ($record) => $record->currentStage?->color ?? 'gray'),
                            Infolists\Components\TextEntry::make('tray_count')
                                ->label('Tray Count')

select * from `crop_stages` where `crop_stages`.`id` = 1 limit 1
---
                                return $realCrop->time_to_next_stage_display ?? 'N/A';
                            }),

                        Infolists\Components\TextEntry::make('total_age_display')
                            ->label('Total Age')
                            ->getStateUsing(function ($record) {
                                // Get a real crop record and force refresh time calculations
                                $realCrop = \App\Models\Crop::with(['currentStage', 'recipe'])
                                    ->where('recipe_id', $record->recipe_id)
                                    ->where('planting_at', $record->planting_at)
                                    ->where('current_stage_id', $record->current_stage_id)
                                    ->first();

                                if (!$realCrop) {
                                    return 'N/A';
                                }

                                // Force refresh the time calculations
                                $calculator = app(\App\Services\CropTimeCalculator::class);
                                $calculator->updateTimeCalculations($realCrop);

                                return $realCrop->total_age_display ?? 'N/A';
                            }),

select `name`, `id` from `crop_stages`
select * from `crop_stages` where `crop_stages`.`id` = 5 limit 1
select * from `recipes` where `recipes`.`id` = 19 limit 1
select * from `crop_stages` where `crop_stages`.`id` in (5)
select * from `crops` where `recipe_id` = 18 and `planting_at` = '2025-07-20 14:00:00' and `current_stage_id` = 5 limit 1
select * from `recipes` where `recipes`.`id` in (18)
select * from `recipes` where `recipes`.`id` = 2 limit 1
---
                    })
                    ->toggleable(),
                Tables\Columns\TextColumn::make('current_stage_name')
                    ->label('Current Stage')
                    ->badge()
                    ->getStateUsing(function ($record) {
                        if (isset($record->currentStage) && is_object($record->currentStage)) {
                            return $record->currentStage->name;
                        }
                        // Fallback: load the stage directly
                        $stage = \App\Models\CropStage::find($record->current_stage_id);
                        return $stage?->name ?? 'Unknown';
                    })
                    ->color(function ($record) {
                        if (isset($record->currentStage) && is_object($record->currentStage)) {
                            return $record->currentStage->color ?? 'gray';
                        }
                        // Fallback: load the stage directly
                        $stage = \App\Models\CropStage::find($record->current_stage_id);
                        return $stage?->color ?? 'gray';
                    })
                    ->searchable()
                    ->sortable()
                    ->toggleable(),
                Tables\Columns\TextColumn::make('stage_age_display')
                    ->label('Time in Stage')
                    ->getStateUsing(function ($record): string {
                        // Get a real crop record and force refresh time calculations
                        $realCrop = \App\Models\Crop::with(['currentStage', 'recipe'])
                            ->where('recipe_id', $record->recipe_id)
                            ->where('planting_at', $record->planting_at)
                            ->where('current_stage_id', $record->current_stage_id)
                            ->first();

                        if (!$realCrop) {
                            return 'N/A';
                        }

                        // Force refresh the time calculations
                        $calculator = app(\App\Services\CropTimeCalculator::class);
                        $calculator->updateTimeCalculations($realCrop);

                        return $realCrop->stage_age_display ?? 'N/A';
                    })
                    ->sortable(query: function (Builder $query, string $direction): Builder {
                        return $query->orderBy('stage_age_minutes', $direction);
                    })
                    ->toggleable(),
                Tables\Columns\TextColumn::make('time_to_next_stage_display')
                    ->label('Time to Next Stage')
                    ->getStateUsing(function ($record): string {
                        // Get a real crop record and force refresh time calculations
                        $realCrop = \App\Models\Crop::with(['currentStage', 'recipe'])
                            ->where('recipe_id', $record->recipe_id)
                            ->where('planting_at', $record->planting_at)
                            ->where('current_stage_id', $record->current_stage_id)
                            ->first();

                        if (!$realCrop) {
                            return 'N/A';
                        }

                        // Force refresh the time calculations
                        $calculator = app(\App\Services\CropTimeCalculator::class);
                        $calculator->updateTimeCalculations($realCrop);

                        return $realCrop->time_to_next_stage_display ?? 'N/A';
                    })
                    ->sortable(query: function (Builder $query, string $direction): Builder {
                        return $query->orderBy('time_to_next_stage_minutes', $direction);
                    })
                    ->toggleable(),
                Tables\Columns\TextColumn::make('total_age_display')
                    ->label('Total Age')
                    ->getStateUsing(function ($record): string {
                        // Get a real crop record and force refresh time calculations
                        $realCrop = \App\Models\Crop::with(['currentStage', 'recipe'])
                            ->where('recipe_id', $record->recipe_id)
                            ->where('planting_at', $record->planting_at)
                            ->where('current_stage_id', $record->current_stage_id)
                            ->first();

                        if (!$realCrop) {
                            return 'N/A';
                        }

                        // Force refresh the time calculations
                        $calculator = app(\App\Services\CropTimeCalculator::class);
                        $calculator->updateTimeCalculations($realCrop);

                        return $realCrop->total_age_display ?? 'N/A';
                    })
                    ->sortable(query: function (Builder $query, string $direction): Builder {