app/Filament/Resources/CropResource.php

            ->bulkActions([
                Tables\Actions\BulkActionGroup::make([
                    Tables\Actions\DeleteBulkAction::make(),
                    Tables\Actions\BulkAction::make('advance_stage_bulk')
                        ->label('Advance Stage')
                        ->icon('heroicon-o-arrow-right')
                        ->form([
                            Forms\Components\DateTimePicker::make('advancement_timestamp')
                                ->label('When did this advancement occur?')
                                ->default(now())
                                ->seconds(false)
                                ->required()
                                ->maxDate(now())
                                ->helperText('Specify the actual time when the stage advancement happened'),
                        ])
                        ->action(function ($records, array $data) {
                            $totalCount = 0;
                            $batchCount = 0;

                            DB::beginTransaction();
                            try {
                                foreach ($records as $record) {
                                    if ($record->current_stage !== 'harvested') {
                                        // Find ALL crops in this batch
                                        $crops = Crop::with('recipe')
                                            ->where('recipe_id', $record->recipe_id)
                                            ->where('planting_at', $record->planting_at)
                                            ->where('current_stage', $record->current_stage)
                                            ->get();

                                        $nextStage = $crops->first()->getNextStage();
                                        if ($nextStage) {
                                            $advancementTime = $data['advancement_timestamp'];
                                            foreach ($crops as $crop) {
                                                $timestampField = "{$nextStage}_at";
---
select * from `crop_stages` where `crop_stages`.`id` = 5 limit 1