app/Filament/Resources/OrderResource.php

select exists(select * from `crop_plans` where `crop_plans`.`order_id` = 348 and `crop_plans`.`order_id` is not null) as `exists`
---
                        }
                    }),

                Tables\Actions\Action::make('generate_crop_plans')
                    ->label('Generate Crop Plans')
                    ->icon('heroicon-o-sparkles')
                    ->color('success')
                    ->visible(fn (Order $record): bool =>
                        $record->requiresCropProduction() &&
                        !$record->isInFinalState() &&
                        !$record->cropPlans()->exists()
                    )
                    ->requiresConfirmation()
                    ->modalHeading('Generate Crop Plans')
                    ->modalDescription(fn (Order $record) =>
                        "This will analyze the order items and generate crop plans based on the delivery date."
                    )
                    ->action(function (Order $record) {
                        $orderPlanningService = app(OrderPlanningService::class);
                        $result = $orderPlanningService->generatePlansForOrder($record);

                        if ($result['success']) {
                            Notification::make()
                                ->title('Crop Plans Generated')
                                ->body("Successfully generated {$result['plans']->count()} crop plans.")
                                ->success()
                                ->send();
                        } else {
                            Notification::make()
                                ->title('Generation Failed')
                                ->body(implode(' ', $result['issues']))
                                ->danger()