app/Filament/Resources/RecipeResource.php

select * from `consumables` where `consumable_type_id` = 3 and `lot_no` = '38124' and `is_active` = 1 limit 1
---
                                continue;
                            }

                            $consumable = Consumable::where('consumable_type_id', $seedTypeId)
                                ->where('lot_no', $lotNumber)
                                ->where('is_active', true)
                                ->first();