app/Models/ConsumableType.php

select `name`, `id` from `consumable_types` where `is_active` = 1 order by `sort_order` asc, `name` asc
---
    public static function options(): array
    {
        return static::where('is_active', true)
            ->orderBy('sort_order')
            ->orderBy('name')
            ->pluck('name', 'id')
            ->toArray();