app/Models/ConsumableUnit.php

    public static function options(): array
    {
        return static::where('is_active', true)
            ->orderBy('sort_order')
            ->orderBy('name')
            ->pluck('name', 'id')
            ->toArray();
---
select `name`, `id` from `consumable_units` where `is_active` = 1 order by `sort_order` asc, `name` asc