app/Models/CropPlanStatus.php

select * from `crop_plan_statuses` where `code` = 'draft' limit 1
---
    public static function findByCode(string $code): ?self
    {
        return static::where('code', $code)->first();