app/Models/CropBatch.php

select * from `crop_stages`
---
    public function getComputedAttributes(): array
    {
        // Return cache if already computed
        if ($this->computedAttributesCache !== null) {
            return $this->computedAttributesCache;
        }

        $firstCrop = $this->crops->first();

        if (!$firstCrop) {
            $this->computedAttributesCache = [
                'germination_at' => null,
                'tray_numbers' => [],
                'tray_count' => 0,
                'current_stage_id' => null,
                'current_stage_name' => null,
                'stage_age_display' => null,
                'time_to_next_stage_display' => null,
                'total_age_display' => null,
                'expected_harvest_at' => null,
            ];
            return $this->computedAttributesCache;
        }

        $calculator = new CropTimeCalculator();

        // Use cached stages if available
        static $stagesCache = null;
        if ($stagesCache === null) {
            $stagesCache = \App\Models\CropStage::all()->keyBy('id');
        }
        $stage = $stagesCache->get($firstCrop->current_stage_id);

select * from `crop_stages`
---
    public function getCurrentStageNameAttribute(): ?string
    {
        $firstCrop = $this->getFirstCrop();

        if (!$firstCrop || !$firstCrop->current_stage_id) {
            return null;
        }

        // Use cached stages to avoid queries
        static $stagesCache = null;
        if ($stagesCache === null) {
            $stagesCache = \App\Models\CropStage::all()->keyBy('id');
        }

        $stage = $stagesCache->get($firstCrop->current_stage_id);