app/Models/CropStage.php

select * from `crop_stages` where `code` = 'soaking' limit 1
---
    public static function findByCode(string $code): ?self
    {
        return static::where('code', $code)->first();