app/Models/Order.php

select * from `payment_statuses` where `code` = 'completed' limit 1
select sum(`amount`) as aggregate from `payments` where `payments`.`order_id` = 348 and `payments`.`order_id` is not null and `status_id` = 2
---
    public function remainingBalance(): float
    {
        $total = $this->totalAmount();
        $completedStatusId = PaymentStatus::where('code', 'completed')->first()?->id;
        if (!$completedStatusId) {
            return $total;
        }
        $paid = $this->payments()->where('status_id', $completedStatusId)->sum('amount');