app/Models/OrderStatus.php

select * from `order_statuses` where `is_active` = 1 order by `sort_order` asc
---
    public static function getGroupedByStage(): Collection
    {
        return self::query()
            ->where('is_active', true)
            ->orderBy('sort_order')
            ->get()
            ->groupBy('stage');