app/Models/RecipeOptimizedView.php

    public static function getOptions(): array
    {
        return static::active()
            ->orderBy('common_name')
            ->orderBy('cultivar_name')
            ->pluck('name', 'id')
            ->toArray();
---
select `name`, `id` from `recipes_optimized_view` where `is_active` = 1 order by `common_name` asc, `cultivar_name` asc