app/Filament/Pages/ActiveSoaking.php

select * from `crop_stages` where `crop_stages`.`id` in (1)
select * from `crops` where `current_stage_id` = 1 and `requires_soaking` = 1 and `soaking_at` is not null order by `soaking_at` asc
select * from `master_cultivars` where `master_cultivars`.`id` in (20)
select * from `master_seed_catalog` where `master_seed_catalog`.`id` in (17)
---
    public function getActiveSoakingBatches(): Collection
    {
        $soakingStage = CropStage::findByCode('soaking');

        if (!$soakingStage) {
            return collect();
        }

        $crops = Crop::with(['recipe.masterCultivar.masterSeedCatalog', 'recipe.masterSeedCatalog', 'currentStage'])
            ->where('current_stage_id', $soakingStage->id)
            ->where('requires_soaking', true)
            ->whereNotNull('soaking_at')
            ->orderBy('soaking_at')
            ->get();