app/Filament/Pages/DailyOperations.php

select count(*) as aggregate from `crops` inner join `crop_stages` on `crops`.`current_stage_id` = `crop_stages`.`id` where `crop_stages`.`code` != 'harvested' and time_to_next_stage_minutes <= 0
select count(*) as aggregate from `consumables` where (initial_stock - consumed_quantity) <= restock_threshold
select count(*) as aggregate from `orders` inner join `order_statuses` on `orders`.`status_id` = `order_statuses`.`id` where `order_statuses`.`code` = 'pending'
select count(*) as aggregate from `crops` inner join `crop_stages` on `crops`.`current_stage_id` = `crop_stages`.`id` where `crop_stages`.`code` = 'light' and time_to_next_stage_minutes <= 0
---
    protected function getStats(): array
    {
        $today = Carbon::today();

        return [
            'crops_to_advance' => Crop::whereHas('currentStage', function($query) {
                    $query->where('code', '!=', 'harvested');
                })
                ->count(),
            'todays_alerts' => CropAlert::whereDate('next_run_at', $today)
                ->where('is_active', true)
                ->count(),
            'low_stock_items' => Consumable::whereRaw('(initial_stock - consumed_quantity) <= restock_threshold')
                ->count(),
            'pending_orders' => Order::join('order_statuses', 'orders.status_id', '=', 'order_statuses.id')
                ->where('order_statuses.code', '=', 'pending')
                ->count(),
            'crops_ready_to_harvest' => Crop::whereHas('currentStage', function($query) {
                    $query->where('code', '=', 'light');
                })
                ->count(),
        ];