app/Filament/Pages/Dashboard.php

select count(*) as aggregate from `crops` where exists (select * from `crop_stages` where `crops`.`current_stage_id` = `crop_stages`.`id` and `code` != 'harvested')
---
    protected function getActiveCropsCount(): int
    {
        return Crop::whereHas('currentStage', function($query) {
            $query->where('code', '!=', 'harvested');
        })->count();

select count(distinct `tray_number`) as aggregate from `crops` where exists (select * from `crop_stages` where `crops`.`current_stage_id` = `crop_stages`.`id` and `code` != 'harvested')
---
    protected function getActiveTraysCount(): int
    {
        return Crop::whereHas('currentStage', function($query) {
            $query->where('code', '!=', 'harvested');
        })->distinct('tray_number')->count();

select count(*) as aggregate from `task_schedules` where `resource_type` = 'crops' and `is_active` = 1
---
    protected function getTasksCount(): int
    {
        return TaskSchedule::where('resource_type', 'crops')->where('is_active', true)->count();

select count(*) as aggregate from `task_schedules` where `resource_type` = 'crops' and `is_active` = 1 and `next_run_at` < '2025-07-21 08:43:41'
---
    protected function getOverdueTasksCount(): int
    {
        return TaskSchedule::where('resource_type', 'crops')
            ->where('is_active', true)
            ->where('next_run_at', '<', now())
            ->count();

select * from `crops` where exists (select * from `crop_stages` where `crops`.`current_stage_id` = `crop_stages`.`id` and `code` = 'light') and `light_at` < '2025-07-14 08:43:41' limit 5
---
    protected function getCropsNeedingHarvest()
    {
        return Crop::whereHas('currentStage', function($query) {
                $query->where('code', 'light');
            })
            ->where('light_at', '<', now()->subDays(7)) // Example logic
            ->with(['recipe.masterSeedCatalog', 'recipe.masterCultivar'])
            ->take(5)
            ->get();

select * from `crops` where exists (select * from `crop_stages` where `crops`.`current_stage_id` = `crop_stages`.`id` and `code` = 'planting') order by `germination_at` desc limit 5
---
    protected function getRecentlySowedCrops()
    {
        return Crop::whereHas('currentStage', function($query) {
                $query->where('code', 'planting');
            })
            ->orderBy('germination_at', 'desc')
            ->with(['recipe.masterSeedCatalog', 'recipe.masterCultivar'])
            ->take(5)
            ->get();

select * from `task_schedules` where `resource_type` = 'crops' and `is_active` = 1 and `next_run_at` >= '2025-07-21 08:43:41' and `next_run_at` < '2025-07-22 00:00:00' order by `next_run_at` asc
select * from `task_schedules` where `resource_type` = 'crops' and `is_active` = 1 and `next_run_at` >= '2025-07-21 14:37:35' and `next_run_at` < '2025-07-22 00:00:00' order by `next_run_at` asc
---
    protected function getTodaysAlerts()
    {
        $now = now();
        $today = now()->startOfDay();
        $tomorrow = now()->addDay()->startOfDay();

        $alerts = TaskSchedule::where('resource_type', 'crops')
            ->where('is_active', true)
            ->where('next_run_at', '>=', $now) // Only get alerts from now onwards (not overdue)
            ->where('next_run_at', '<', $tomorrow)
            ->orderBy('next_run_at', 'asc')
            ->get();

        return $this->groupAlertsByBatch($alerts);

select * from `task_schedules` where `resource_type` = 'crops' and `is_active` = 1 and `next_run_at` >= '2025-07-21 08:43:41' and `next_run_at` <= '2025-07-28 08:43:41' order by `next_run_at` asc
select * from `task_schedules` where `resource_type` = 'crops' and `is_active` = 1 and `next_run_at` >= '2025-07-21 14:37:35' and `next_run_at` <= '2025-07-28 14:37:35' order by `next_run_at` asc
---
    protected function getUpcomingAlerts()
    {
        $now = now();
        $nextWeek = now()->addDays(7);

        $alerts = TaskSchedule::where('resource_type', 'crops')
            ->where('is_active', true)
            ->where('next_run_at', '>=', $now)
            ->where('next_run_at', '<=', $nextWeek)
            ->orderBy('next_run_at', 'asc')
            ->get();

        return $this->groupAlertsByBatch($alerts);

select * from `task_schedules` where `resource_type` = 'crops' and `is_active` = 1 and `next_run_at` < '2025-07-21 08:43:41' order by `next_run_at` asc
select * from `task_schedules` where `resource_type` = 'crops' and `is_active` = 1 and `next_run_at` < '2025-07-23 15:24:43' order by `next_run_at` asc
---
    protected function getOverdueAlerts()
    {
        $now = now();

        $alerts = TaskSchedule::where('resource_type', 'crops')
            ->where('is_active', true)
            ->where('next_run_at', '<', $now)
            ->orderBy('next_run_at', 'asc')
            ->get();

        return $this->groupAlertsByBatch($alerts, true);

select * from `crop_stages` where `crop_stages`.`id` in (1, 2)
select * from `master_cultivars` where `master_cultivars`.`id` in (20)
select * from `master_seed_catalog` where `master_seed_catalog`.`id` in (17)
select * from `recipes` where `recipes`.`id` in (1, 2)
select * from `crop_stages` where `crop_stages`.`id` = 1 limit 1
---
    protected function groupAlertsByBatch($alerts, $isOverdue = false)
    {
        $groupedAlerts = [];

        // Pre-load all crops to avoid N+1 queries
        $cropIds = $alerts->map(fn($alert) => $alert->conditions['crop_id'] ?? null)->filter()->unique();
        $crops = Crop::with(['recipe.masterSeedCatalog', 'recipe.masterCultivar'])->whereIn('id', $cropIds)->get()->keyBy('id');

        // Pre-load all batch crops to avoid N+1 queries
        $allCrops = Crop::with(['recipe.masterSeedCatalog', 'recipe.masterCultivar', 'currentStage'])->get()->groupBy(function($crop) {
            $plantedAt = $crop->germination_at ? $crop->germination_at->format('Y-m-d') : 'unknown';
            $stageCode = 'unknown';

            // Safely get the stage code
            if ($crop->relationLoaded('currentStage') && $crop->currentStage && is_object($crop->currentStage)) {
                $stageCode = $crop->currentStage->code;
            } elseif ($crop->current_stage_id) {
                // Fallback: load the stage directly
                $stage = \App\Models\CropStage::find($crop->current_stage_id);
                $stageCode = $stage?->code ?? 'unknown';
            }

            return "{$crop->recipe_id}|{$plantedAt}|{$stageCode}";
        });

select * from `crop_stages` where `crop_stages`.`id` = 1 limit 1
---
            if ($crop->relationLoaded('currentStage') && $crop->currentStage && is_object($crop->currentStage)) {
                $currentStage = $crop->currentStage->code;
            } elseif ($crop->current_stage_id) {
                $stage = \App\Models\CropStage::find($crop->current_stage_id);

select * from `crop_stages` where `crop_stages`.`id` in (1, 2, 3, 5)
select * from `crops` where exists (select * from `crop_stages` where `crops`.`current_stage_id` = `crop_stages`.`id` and `code` != 'harvested')
select * from `recipes` where `recipes`.`id` in (3, 5, 7, 8, 9, 12, 13, 15, 16, 18, 19)
select * from `recipes` where `recipes`.`id` in (1, 2)
select * from `crop_stages` where `crop_stages`.`id` = 3 limit 1
select * from `crop_stages` where `crop_stages`.`id` = 1 limit 1
---
    protected function getCropsByStage(): array
    {
        $crops = Crop::whereHas('currentStage', function($query) {
                $query->where('code', '!=', 'harvested');
            })
            ->with(['recipe', 'currentStage'])
            ->get()
            ->groupBy(function($crop) {
                if ($crop->relationLoaded('currentStage') && $crop->currentStage && is_object($crop->currentStage)) {
                    return $crop->currentStage->code;
                } elseif ($crop->current_stage_id) {
                    $stage = \App\Models\CropStage::find($crop->current_stage_id);
                    return $stage?->code ?? 'unknown';
                }
                return 'unknown';
            });

        $stageData = [];
        foreach (['planting', 'germination', 'blackout', 'light'] as $stage) {
            $stageCrops = $crops->get($stage, collect());

select * from `consumables` where exists (select * from `consumable_types` where `consumables`.`consumable_type_id` = `consumable_types`.`id` and `code` = 'seed') and (total_quantity <= restock_threshold or (initial_stock - consumed_quantity) <= restock_threshold) order by `total_quantity` asc limit 8
---
    protected function getSeedInventoryAlerts()
    {
        return Consumable::whereHas('consumableType', function($query) {
                $query->where('code', 'seed');
            })
            ->where(function ($query) {
                $query->whereRaw('total_quantity <= restock_threshold')
                      ->orWhereRaw('(initial_stock - consumed_quantity) <= restock_threshold');
            })
            ->with(['masterSeedCatalog'])
            ->orderBy('total_quantity', 'asc')
            ->take(8)
            ->get();

select * from `crop_stages` where `crop_stages`.`id` in (3)
---
    protected function getStageTimings(Crop $crop): array
    {
        $timings = [];

        // Load current stage if not loaded
        if (!$crop->relationLoaded('currentStage')) {
            $crop->load('currentStage');