app/Filament/Pages/Dashboard.php

select * from `crops` where exists (select * from `crop_stages` where `crops`.`current_stage_id` = `crop_stages`.`id` and `code` = 'planting') order by `planting_at` desc limit 5
---
    protected function getRecentlySowedCrops()
    {
        return Crop::whereHas('currentStage', function($query) {
                $query->where('code', 'planting');
            })
            ->orderBy('planting_at', 'desc')
            ->with(['recipe.seedEntry'])
            ->take(5)
            ->get();