app/Filament/Pages/ManageFailedSeedEntries.php

select sum(`failed_entries_count`) as aggregate from `seed_scrape_uploads` where `failed_entries_count` > 0
---
    public static function getNavigationBadge(): ?string
    {
        return SeedScrapeUpload::where('failed_entries_count', '>', 0)->sum('failed_entries_count') ?: null;