app/Filament/Pages/WeeklyPlanning.php

select * from `orders` where `harvest_date` = '2025-07-17'
---
    public function getViewData(): array
    {
        $selectedDate = $this->selectedDate ? Carbon::parse($this->selectedDate) : Carbon::now();

        // Get Wednesday of the selected week
        $wednesday = $selectedDate->copy()->startOfWeek()->addDays(3);

        // Get orders for this week's harvest (Wednesday)
        $harvests = Order::where('harvest_date', $wednesday->toDateString())
            ->with(['orderItems.item', 'crops', 'user'])
            ->get();

select * from `crop_stages` where `crop_stages`.`id` in (1, 2, 3, 5)
select * from `crops` where `current_stage_id` != 4 order by `planting_at` desc
select * from `recipes` where `recipes`.`id` in (3, 5, 7, 8, 9, 12, 13, 15, 16, 18, 19)
---

        // Get active crops (not harvested)
        $harvestedStage = \App\Models\CropStage::findByCode('harvested');
        $activeCrops = Crop::where('current_stage_id', '!=', $harvestedStage?->id)
            ->with(['recipe', 'order.user', 'currentStage'])
            ->orderBy('planting_at', 'desc')
            ->get();